<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"e92095736dc7b02474c83ebf0c5905c764df49f135741b3df2ec71da94a39635","plan_job_ref":"Job Create terraform plan #23 at https://github.com/presentium/infrastructure/actions/runs/10286036093","plan_hash":"c501e517df57d908b213a0aa8e3201e1f6e7b50b79a50a5c44b6f1c0fa5be2b1","plan_text_format":"diff-trunc","version":"1.44.0","plan_out_hash":"07e131d82a50c329207abf5de432465af56e693f312b70c112889559a6554c9d"} -->
Terraform plan in __infrastructure__
<details>
<summary>Plan: 45 to add, 45 to change, 18 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-   destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.argocd.null_resource.argocd_apply_once will be created
+   resource "null_resource" "argocd_apply_once" {
+       id       = (known after apply)
+       triggers = {
+           "static" = "poorly-social-pigeon"
        }
    }

  # module.cloudflare.cloudflare_record.status_record will be destroyed
  # (because cloudflare_record.status_record is not in configuration)
-   resource "cloudflare_record" "status_record" {
-       allow_overwrite = false -> null
-       created_on      = "2024-07-24T08:17:26.708965Z" -> null
-       hostname        = "status.presentium.ch" -> null
-       id              = "47185a82589ebfd37ee634558648205e" -> null
-       metadata        = {
-           "auto_added"             = "false"
-           "managed_by_apps"        = "false"
-           "managed_by_argo_tunnel" = "false"
        } -> null
-       modified_on     = "2024-07-24T08:17:26.708965Z" -> null
-       name            = "status" -> null
-       proxiable       = true -> null
-       proxied         = false -> null
-       tags            = [] -> null
-       ttl             = 1 -> null
-       type            = "CNAME" -> null
-       value           = "presentium.github.io" -> null
-       zone_id         = "660bdc1364b1611625fb1a09ffe6e289" -> null
#        (1 unchanged attribute hidden)
    }

  # module.eks.aws_iam_policy.rds_policy["api-prod"] will be created
+   resource "aws_iam_policy" "rds_policy" {
+       arn              = (known after apply)
+       attachment_count = (known after apply)
+       description      = "Provides permissions to connect to RDS"
+       id               = (known after apply)
+       name             = (known after apply)
+       name_prefix      = "presentium-rds-policy-api-prod-"
+       path             = "/"
+       policy           = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = "rds-db:connect"
+                       Effect   = "Allow"
+                       Resource = "arn:aws:rds-db:eu-west-1:123247571664:dbuser:db-presentium/presentium-prod"
+                       Sid      = "Allow RDS access"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id        = (known after apply)
+       tags_all         = {
+           "Terraform" = "true"
        }
    }

  # module.eks.aws_iam_policy.rds_policy["api-staging"] will be created
+   resource "aws_iam_policy" "rds_policy" {
+       arn              = (known after apply)
+       attachment_count = (known after apply)
+       description      = "Provides permissions to connect to RDS"
+       id               = (known after apply)
+       name             = (known after apply)
+       name_prefix      = "presentium-rds-policy-api-staging-"
+       path             = "/"
+       policy           = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = "rds-db:connect"
+                       Effect   = "Allow"
+                       Resource = "arn:aws:rds-db:eu-west-1:123247571664:dbuser:db-presentium/presentium-staging"
+                       Sid      = "Allow RDS access"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id        = (known after apply)
+       tags_all         = {
+           "Terraform" = "true"
        }
    }

  # module.eks.aws_iam_policy.rds_policy["authentik"] will be created
+   resource "aws_iam_policy" "rds_policy" {
+       arn              = (known after apply)
+       attachment_count = (known after apply)
+       description      = "Provides permissions to connect to RDS"
+       id               = (known after apply)
+       name             = (known after apply)
+       name_prefix      = "presentium-rds-policy-authentik-"
+       path             = "/"
+       policy           = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = "rds-db:connect"
+                       Effect   = "Allow"
+                       Resource = "arn:aws:rds-db:eu-west-1:123247571664:dbuser:db-presentium/authentik"
+                       Sid      = "Allow RDS access"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id        = (known after apply)
+       tags_all         = {
+           "Terraform" = "true"
        }
    }

  # module.eks.aws_iam_policy.sops_policy will be created
+   resource "aws_iam_policy" "sops_policy" {
+       arn              = (known after apply)
+       attachment_count = (known after apply)
+       description      = "Provides permissions to use KMS for SOPS"
+       id               = (known after apply)
+       name             = (known after apply)
+       name_prefix      = "presentium-sops-policy-"
+       path             = "/"
+       policy           = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "kms:ReEncrypt*",
+                           "kms:GenerateDataKey*",
+                           "kms:Encrypt",
+                           "kms:DescribeKey",
+                           "kms:Decrypt",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
+                       Sid      = "Allow use of the key"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id        = (known after apply)
+       tags_all         = {
+           "Terraform" = "true"
        }
    }

  # module.iam.aws_iam_role.eks_admin will be created
+   resource "aws_iam_role" "eks_admin" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           AWS = [
+                               "awn:aws:iam::123247571664:user/Sacha",
+                               "awn:aws:iam::123247571664:user/Massimo",
+                               "awn:aws:iam::123247571664:user/Loic",
+                               "awn:aws:iam::123247571664:user/Lea",
+                               "awn:aws:iam::123247571664:user/Christophe",
                            ]
                        }
+                       Sid       = "Allow assume for users"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "PRES-EKS-ADMIN"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = {
+           "Terraform" = "true"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # module.iam.aws_iam_user.user["Christophe"] will be updated in-place
!~  resource "aws_iam_user" "user" {
        id                   = "Christophe"
        name                 = "Christophe"
!~      tags                 = {
-           "tag-key" = "tag-value" -> null
        }
!~      tags_all             = {
+           "Terraform" = "true"
-           "tag-key"   = "tag-value" -> null
        }
#        (5 unchanged attributes hidden)
    }

  # module.iam.aws_iam_user.user["Lea"] will be updated in-place
!~  resource "aws_iam_user" "user" {
        id                   = "Lea"
        name                 = "Lea"
!~      tags                 = {
-           "tag-key" = "tag-value" -> null
        }
!~      tags_all             = {
+           "Terraform" = "true"
-           "tag-key"   = "tag-value" -> null
        }
#        (5 unchanged attributes hidden)
    }

  # module.iam.aws_iam_user.user["Loic"] will be updated in-place
!~  resource "aws_iam_user" "user" {
        id                   = "Loic"
        name                 = "Loic"
!~      tags                 = {
-           "AKIARZMRAWLIMRMQ5JU7" = "CLI access" -> null
-           "tag-key"              = "tag-value" -> null
        }
!~      tags_all             = {
-           "AKIARZMRAWLIMRMQ5JU7" = "CLI access" -> null
+           "Terraform"            = "true"
-           "tag-key"              = "tag-value" -> null
        }
#        (5 unchanged attributes hidden)
    }

  # module.iam.aws_iam_user.user["Massimo"] will be updated in-place
!~  resource "aws_iam_user" "user" {
        id                   = "Massimo"
        name                 = "Massimo"
!~      tags                 = {
-           "tag-key" = "tag-value" -> null
        }
!~      tags_all             = {
+           "Terraform" = "true"
-           "tag-key"   = "tag-value" -> null
        }
#        (5 unchanged attributes hidden)
    }

  # module.iam.aws_iam_user.user["Sacha"] will be updated in-place
!~  resource "aws_iam_user" "user" {
        id                   = "Sacha"
        name                 = "Sacha"
!~      tags                 = {
-           "tag-key" = "tag-value" -> null
        }
!~      tags_all             = {
+           "Terraform" = "true"
-           "tag-key"   = "tag-value" -> null
        }
#        (5 unchanged attributes hidden)
    }

  # module.iam.aws_iam_user_policy_attachment.attach_admin["Christophe"] will be created
+   resource "aws_iam_user_policy_attachment" "attach_admin" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
+       user       = "Christophe"
    }

  # module.iam.aws_iam_user_policy_attachment.attach_admin["Lea"] will be created
+   resource "aws_iam_user_policy_attachment" "attach_admin" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
+       user       = "Lea"
    }

  # module.iam.aws_iam_user_policy_attachment.attach_admin["Loic"] will be created
+   resource "aws_iam_user_policy_attachment" "attach_admin" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
+       user       = "Loic"
    }

  # module.iam.aws_iam_user_policy_attachment.attach_admin["Massimo"] will be created
+   resource "aws_iam_user_policy_attachment" "attach_admin" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
+       user       = "Massimo"
    }

  # module.iam.aws_iam_user_policy_attachment.attach_admin["Sacha"] will be created
+   resource "aws_iam_user_policy_attachment" "attach_admin" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
+       user       = "Sacha"
    }

  # module.iam.aws_iam_user_policy_attachment.test-attach["Christophe"] will be destroyed
  # (because aws_iam_user_policy_attachment.test-attach is not in configuration)
-   resource "aws_iam_user_policy_attachment" "test-attach" {
-       id         = "Christophe-20240725215451764200000005" -> null
-       policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess" -> null
-       user       = "Christophe" -> null
    }

  # module.iam.aws_iam_user_policy_attachment.test-attach["Lea"] will be destroyed
  # (because aws_iam_user_policy_attachment.test-attach is not in configuration)
-   resource "aws_iam_user_policy_attachment" "test-attach" {
-       id         = "Lea-20240725215451828000000007" -> null
-       policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess" -> null
-       user       = "Lea" -> null
    }

  # module.iam.aws_iam_user_policy_attachment.test-attach["Loic"] will be destroyed
  # (because aws_iam_user_policy_attachment.test-attach is not in configuration)
-   resource "aws_iam_user_policy_attachment" "test-attach" {
-       id         = "Loic-20240725215451679900000003" -> null
-       policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess" -> null
-       user       = "Loic" -> null
    }

  # module.iam.aws_iam_user_policy_attachment.test-attach["Massimo"] will be destroyed
  # (because aws_iam_user_policy_attachment.test-attach is not in configuration)
-   resource "aws_iam_user_policy_attachment" "test-attach" {
-       id         = "Massimo-20240725215451718900000004" -> null
-       policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess" -> null
-       user       = "Massimo" -> null
    }

  # module.iam.aws_iam_user_policy_attachment.test-attach["Sacha"] will be destroyed
  # (because aws_iam_user_policy_attachment.test-attach is not in configuration)
-   resource "aws_iam_user_policy_attachment" "test-attach" {
-       id         = "Sacha-20240725215451773800000006" -> null
-       policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess" -> null
-       user       = "Sacha" -> null
    }

  # module.vpc.data.aws_subnets.private_subnets_primary_cidr will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_subnets" "private_subnets_primary_cidr" {
+       id   = (known after apply)
+       ids  = (known after apply)
+       tags = (known after apply)

+       filter {
+           name   = "cidr-block"
+           values = [
+               "10.0.4.0/24",
+               "10.0.5.0/24",
+               "10.0.6.0/24",
            ]
        }
    }

  # module.vpc.data.aws_subnets.private_subnets_secondary_cidr will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_subnets" "private_subnets_secondary_cidr" {
+       id   = (known after apply)
+       ids  = (known after apply)
+       tags = (known after apply)

+       filter {
+           name   = "cidr-block"
+           values = [
+               "100.64.0.0/20",
+               "100.64.16.0/20",
+               "100.64.32.0/20",
            ]
        }
    }

  # module.eks.module.dbconnect_irsa["api-prod"].aws_iam_role.this[0] will be created
+   resource "aws_iam_role" "this" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRoleWithWebIdentity"
+                       Condition = {
+                           StringEquals = {
+                               "oidc.eks.eu-west-1.amazonaws.com/id/7D237BCA403531BC4EAC898802E8C3E6:aud" = "*****************"
+                               "oidc.eks.eu-west-1.amazonaws.com/id/7D237BCA403531BC4EAC898802E8C3E6:sub" = "****************************************************"
                            }
                        }
+                       Effect    = "Allow"
+                       Principal = {
+                           Federated = "arn:aws:iam::123247571664:oidc-provider/oidc.eks.eu-west-1.amazonaws.com/id/7D237BCA403531BC4EAC898802E8C3E6"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "PRES-DB-API-PROD-PRESENTIUM"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = {
+           "Terraform" = "true"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # module.eks.module.dbconnect_irsa["api-prod"].aws_iam_role_policy_attachment.this["rds"] will be created
+   resource "aws_iam_role_policy_attachment" "this" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "PRES-DB-API-PROD-PRESENTIUM"
    }

  # module.eks.module.dbconnect_irsa["api-staging"].aws_iam_role.this[0] will be created
+   resource "aws_iam_role" "this" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRoleWithWebIdentity"
+                       Condition = {
+                           StringEquals = {
+                               "oidc.eks.eu-west-1.amazonaws.com/id/7D237BCA403531BC4EAC898802E8C3E6:aud" = "*****************"
+                               "oidc.eks.eu-west-1.amazonaws.com/id/7D237BCA403531BC4EAC898802E8C3E6:sub" = "*******************************************************"
                            }
                        }
+                       Effect    = "Allow"
+                       Principal = {
+                           Federated = "arn:aws:iam::123247571664:oidc-provider/oidc.eks.eu-west-1.amazonaws.com/id/7D237BCA403531BC4EAC898802E8C3E6"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "PRES-DB-API-STAGING-PRESENTIUM"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = {
+           "Terraform" = "true"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # module.eks.module.dbconnect_irsa["api-staging"].aws_iam_role_policy_attachment.this["rds"] will be created
+   resource "aws_iam_role_policy_attachment" "this" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "PRES-DB-API-STAGING-PRESENTIUM"
    }

  # module.eks.module.dbconnect_irsa["authentik"].aws_iam_role.this[0] will be created
+   resource "aws_iam_role" "this" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRoleWithWebIdentity"
+                       Condition = {
+                           StringEquals = {
+                               "oidc.eks.eu-west-1.amazonaws.com/id/7D237BCA403531BC4EAC898802E8C3E6:aud" = "*****************"
+                               "oidc.eks.eu-west-1.amazonaws.com/id/7D237BCA403531BC4EAC898802E8C3E6:sub" = "*****************************************"
                            }
                        }
+                       Effect    = "Allow"
+                       Principal = {
+                           Federated = "arn:aws:iam::123247571664:oidc-provider/oidc.eks.eu-west-1.amazonaws.com/id/7D237BCA403531BC4EAC898802E8C3E6"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "PRES-DB-AUTHENTIK-PRESENTIUM"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = {
+           "Terraform" = "true"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # module.eks.module.dbconnect_irsa["authentik"].aws_iam_role_policy_attachment.this["rds"] will be created
+   resource "aws_iam_role_policy_attachment" "this" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "PRES-DB-AUTHENTIK-PRESENTIUM"
    }

  # module.eks.module.eks.data.aws_eks_addon_version.this["coredns"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
+       addon_name         = "coredns"
+       id                 = (known after apply)
+       kubernetes_version = "1.30"
+       version            = (known after apply)
    }

  # module.eks.module.eks.data.aws_eks_addon_version.this["kube-proxy"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
+       addon_name         = "kube-proxy"
+       id                 = (known after apply)
+       kubernetes_version = "1.30"
+       version            = (known after apply)
    }

  # module.eks.module.eks.data.aws_eks_addon_version.this["vpc-cni"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
+       addon_name         = "vpc-cni"
+       id                 = (known after apply)
+       kubernetes_version = "1.30"
+       version            = (known after apply)
    }

  # module.eks.module.eks.data.tls_certificate.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "tls_certificate" "this" {
+       certificates = (known after apply)
+       id           = (known after apply)
+       url          = "https://oidc.eks.eu-west-1.amazonaws.com/id/7D237BCA403531BC4EAC898802E8C3E6"
    }

  # module.eks.module.eks.aws_cloudwatch_log_group.this[0] will be updated in-place
!~  resource "aws_cloudwatch_log_group" "this" {
        id                = "/aws/eks/presentium/cluster"
        name              = "/aws/eks/presentium/cluster"
        tags              = {
            "Name"                   = "/aws/eks/presentium/cluster"
            "karpenter.sh/discovery" = "presentium"
        }
!~      tags_all          = {
+           "Terraform"              = "true"
#            (2 unchanged elements hidden)
        }
#        (6 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_eks_access_entry.this["admins"] will be created
+   resource "aws_eks_access_entry" "this" {
+       access_entry_arn  = (known after apply)
+       cluster_name      = "presentium"
+       created_at        = (known after apply)
+       id                = (known after apply)
+       kubernetes_groups = (known after apply)
+       modified_at       = (known after apply)
+       principal_arn     = (known after apply)
+       tags              = {
+           "karpenter.sh/discovery" = "presentium"
        }
+       tags_all          = {
+           "Terraform"              = "true"
+           "karpenter.sh/discovery" = "presentium"
        }
+       type              = "STANDARD"
+       user_name         = (known after apply)
    }

  # module.eks.module.eks.aws_eks_access_policy_association.this["admins_example"] will be created
+   resource "aws_eks_access_policy_association" "this" {
+       associated_at = (known after apply)
+       cluster_name  = "presentium"
+       id            = (known after apply)
+       modified_at   = (known after apply)
+       policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSViewPolicy"
+       principal_arn = (known after apply)

+       access_scope {
+           type = "cluster"
        }
    }

  # module.eks.module.eks.aws_eks_addon.this["coredns"] will be updated in-place
!~  resource "aws_eks_addon" "this" {
        id                          = "presentium:coredns"
        tags                        = {
            "karpenter.sh/discovery" = "presentium"
        }
!~      tags_all                    = {
+           "Terraform"              = "true"
#            (1 unchanged element hidden)
        }
#        (11 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # module.eks.module.eks.aws_eks_addon.this["kube-proxy"] will be updated in-place
!~  resource "aws_eks_addon" "this" {
        id                          = "presentium:kube-proxy"
        tags                        = {
            "karpenter.sh/discovery" = "presentium"
        }
!~      tags_all                    = {
+           "Terraform"              = "true"
#            (1 unchanged element hidden)
        }
#        (11 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # module.eks.module.eks.aws_eks_addon.this["vpc-cni"] will be updated in-place
!~  resource "aws_eks_addon" "this" {
        id                          = "presentium:vpc-cni"
!~      service_account_role_arn    = "arn:aws:iam::123247571664:role/MORP-VPC-CNI-PRESENTIUM" -> (known after apply)
        tags                        = {
            "karpenter.sh/discovery" = "presentium"
        }
!~      tags_all                    = {
+           "Terraform"              = "true"
#            (1 unchanged element hidden)
        }
#        (10 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # module.eks.module.eks.aws_eks_cluster.this[0] will be updated in-place
!~  resource "aws_eks_cluster" "this" {
        id                            = "presentium"
        name                          = "presentium"
        tags                          = {
            "karpenter.sh/discovery" = "presentium"
            "terraform-aws-modules"  = "eks"
        }
!~      tags_all                      = {
+           "Terraform"              = "true"
#            (2 unchanged elements hidden)
        }
#        (11 unchanged attributes hidden)

#        (6 unchanged blocks hidden)
    }

  # module.eks.module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be updated in-place
!~  resource "aws_iam_openid_connect_provider" "oidc_provider" {
        id              = "arn:aws:iam::123247571664:oidc-provider/oidc.eks.eu-west-1.amazonaws.com/id/7D237BCA403531BC4EAC898802E8C3E6"
        tags            = {
            "Name"                   = "presentium-eks-irsa"
            "karpenter.sh/discovery" = "presentium"
        }
!~      tags_all        = {
+           "Terraform"              = "true"
#            (2 unchanged elements hidden)
        }
!~      thumbprint_list = [
-           "9e99a48a9960b14926bb7f3b02e22da2b0ab7280",
        ] -> (known after apply)
#        (3 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_iam_policy.cluster_encryption[0] will be updated in-place
!~  resource "aws_iam_policy" "cluster_encryption" {
        id               = "arn:aws:iam::123247571664:policy/presentium-cluster-ClusterEncryption2024072521550082340000000a"
        name             = "presentium-cluster-ClusterEncryption2024072521550082340000000a"
        tags             = {
            "karpenter.sh/discovery" = "presentium"
        }
!~      tags_all         = {
+           "Terraform"              = "true"
#            (1 unchanged element hidden)
        }
#        (7 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_iam_role.this[0] will be updated in-place
!~  resource "aws_iam_role" "this" {
        id                    = "presentium-cluster-20240725215451304700000001"
        name                  = "presentium-cluster-20240725215451304700000001"
        tags                  = {
            "karpenter.sh/discovery" = "presentium"
        }
!~      tags_all              = {
+           "Terraform"              = "true"
#            (1 unchanged element hidden)
        }
#        (11 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # module.eks.module.karpenter.data.aws_iam_policy_document.controller[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "controller" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "ec2:CreateFleet",
+               "ec2:RunInstances",
            ]
+           resources = [
+               "arn:aws:ec2:*:*:launch-template/*",
+               "arn:aws:ec2:*:*:security-group/*",
+               "arn:aws:ec2:*:*:spot-instances-request/*",
+               "arn:aws:ec2:*:*:subnet/*",
+               "arn:aws:ec2:*::image/*",
+               "arn:aws:ec2:*::snapshot/*",
            ]
+           sid       = "AllowScopedEC2InstanceActions"
        }
+       statement {
+           actions   = [
+               "ec2:CreateFleet",
+               "ec2:CreateLaunchTemplate",
+               "ec2:RunInstances",
            ]
+           resources = [
+               "arn:aws:ec2:*:*:fleet/*",
+               "arn:aws:ec2:*:*:instance/*",
+               "arn:aws:ec2:*:*:launch-template/*",
+               "arn:aws:ec2:*:*:network-interface/*",
+               "arn:aws:ec2:*:*:spot-instances-request/*",
+               "arn:aws:ec2:*:*:volume/*",
            ]
+           sid       = "AllowScopedEC2InstanceActionsWithTags"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "owned",
                ]
+               variable = "aws:RequestTag/kubernetes.io/cluster/presentium"
            }
+           condition {
+               test     = "StringLike"
+               values   = [
+                   "*",
                ]
+               variable = "aws:RequestTag/karpenter.sh/nodepool"
            }
        }
+       statement {
+           actions   = [
+               "ec2:CreateTags",
            ]
+           resources = [
+               "arn:aws:ec2:*:*:fleet/*",
+               "arn:aws:ec2:*:*:instance/*",
+               "arn:aws:ec2:*:*:launch-template/*",
+               "arn:aws:ec2:*:*:network-interface/*",
+               "arn:aws:ec2:*:*:spot-instances-request/*",
+               "arn:aws:ec2:*:*:volume/*",
            ]
+           sid       = "AllowScopedResourceCreationTagging"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "RunInstances",
+                   "CreateFleet",
+                   "CreateLaunchTemplate",
                ]
+               variable = "ec2:CreateAction"
            }
+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "owned",
                ]
+               variable = "aws:RequestTag/kubernetes.io/cluster/presentium"
            }
+           condition {
+               test     = "StringLike"
+               values   = [
+                   "*",
                ]
+               variable = "aws:RequestTag/karpenter.sh/nodepool"
            }
        }
+       statement {
+           actions   = [
+               "ec2:CreateTags",
            ]
+           resources = [
+               "arn:aws:ec2:*:*:instance/*",
            ]
+           sid       = "AllowScopedResourceTagging"

+           condition {
+               test     = "ForAllValues:StringEquals"
+               values   = [
+                   "karpenter.sh/nodeclaim",
+                   "Name",
                ]
+               variable = "aws:TagKeys"
            }
+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "owned",
                ]
+               variable = "aws:ResourceTag/kubernetes.io/cluster/presentium"
            }
+           condition {
+               test     = "StringLike"
+               values   = [
+                   "*",
                ]
+               variable = "aws:ResourceTag/karpenter.sh/nodepool"
            }
        }
+       statement {
+           actions   = [
+               "ec2:DeleteLaunchTemplate",
+               "ec2:TerminateInstances",
            ]
+           resources = [
+               "arn:aws:ec2:*:*:instance/*",
+               "arn:aws:ec2:*:*:launch-template/*",
            ]
+           sid       = "AllowScopedDeletion"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "owned",
                ]
+               variable = "aws:ResourceTag/kubernetes.io/cluster/presentium"
            }
+           condition {
+               test     = "StringLike"
+               values   = [
+                   "*",
                ]
+               variable = "aws:ResourceTag/karpenter.sh/nodepool"
            }
        }
+       statement {
+           actions   = [
+               "ec2:DescribeAvailabilityZones",
+               "ec2:DescribeImages",
+               "ec2:DescribeInstanceTypeOfferings",
+               "ec2:DescribeInstanceTypes",
+               "ec2:DescribeInstances",
+               "ec2:DescribeLaunchTemplates",
+               "ec2:DescribeSecurityGroups",
+               "ec2:DescribeSpotPriceHistory",
+               "ec2:DescribeSubnets",
            ]
+           resources = [
+               "*",
            ]
+           sid       = "AllowRegionalReadActions"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "eu-west-1",
                ]
+               variable = "aws:RequestedRegion"
            }
        }
+       statement {
+           actions   = [
+               "ssm:GetParameter",
            ]
+           resources = [
+               "arn:aws:ssm:eu-west-1::parameter/aws/service/*",
            ]
+           sid       = "AllowSSMReadActions"
        }
+       statement {
+           actions   = [
+               "pricing:GetProducts",
            ]
+           resources = [
+               "*",
            ]
+           sid       = "AllowPricingReadActions"
        }
+       statement {
+           actions   = [
+               "sqs:DeleteMessage",
+               "sqs:GetQueueAttributes",
+               "sqs:GetQueueUrl",
+               "sqs:ReceiveMessage",
            ]
+           resources = [
+               "arn:aws:sqs:eu-west-1:123247571664:karpenter-presentium",
            ]
+           sid       = "AllowInterruptionQueueActions"
        }
+       statement {
+           actions   = [
+               "iam:PassRole",
            ]
+           resources = [
+               (known after apply),
            ]
+           sid       = "AllowPassingInstanceRole"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "ec2.amazonaws.com",
                ]
+               variable = "iam:PassedToService"
            }
        }
+       statement {
+           actions   = [
+               "iam:CreateInstanceProfile",
            ]
+           resources = [
+               "*",
            ]
+           sid       = "AllowScopedInstanceProfileCreationActions"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "eu-west-1",
                ]
+               variable = "aws:RequestTag/topology.kubernetes.io/region"
            }
+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "owned",
                ]
+               variable = "aws:RequestTag/kubernetes.io/cluster/presentium"
            }
+           condition {
+               test     = "StringLike"
+               values   = [
+                   "*",
                ]
+               variable = "aws:RequestTag/karpenter.k8s.aws/ec2nodeclass"
            }
        }
+       statement {
+           actions   = [
+               "iam:TagInstanceProfile",
            ]
+           resources = [
+               "*",
            ]
+           sid       = "AllowScopedInstanceProfileTagActions"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "eu-west-1",
                ]
+               variable = "aws:ResourceTag/topology.kubernetes.io/region"
            }
+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "owned",
                ]
+               variable = "aws:RequestTag/kubernetes.io/cluster/presentium"
            }
+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "owned",
                ]
+               variable = "aws:ResourceTag/kubernetes.io/cluster/presentium"
            }
+           condition {
+               test     = "StringLike"
+               values   = [
+                   "*",
                ]
+               variable = "aws:RequestTag/karpenter.k8s.aws/ec2nodeclass"
            }
+           condition {
+               test     = "StringLike"
+               values   = [
+                   "*",
                ]
+               variable = "aws:ResourceTag/karpenter.k8s.aws/ec2nodeclass"
            }
        }
+       statement {
+           actions   = [
+               "iam:AddRoleToInstanceProfile",
+               "iam:DeleteInstanceProfile",
+               "iam:RemoveRoleFromInstanceProfile",
            ]
+           resources = [
+               "*",
            ]
+           sid       = "AllowScopedInstanceProfileActions"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "eu-west-1",
                ]
+               variable = "aws:ResourceTag/topology.kubernetes.io/region"
            }
+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "owned",
                ]
+               variable = "aws:ResourceTag/kubernetes.io/cluster/presentium"
            }
+           condition {
+               test     = "StringLike"
+               values   = [
+                   "*",
                ]
+               variable = "aws:ResourceTag/karpenter.k8s.aws/ec2nodeclass"
            }
        }
+       statement {
+           actions   = [
+               "iam:GetInstanceProfile",
            ]
+           resources = [
+               "*",
            ]
+           sid       = "AllowInstanceProfileReadActions"
        }
+       statement {
+           actions   = [
+               "eks:DescribeCluster",
            ]
+           resources = [
+               "arn:aws:eks:eu-west-1:123247571664:cluster/presentium",
            ]
+           sid       = "AllowAPIServerEndpointDiscovery"
        }
    }

  # module.eks.module.karpenter.data.aws_iam_policy_document.queue[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "queue" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "sqs:SendMessage",
            ]
+           resources = [
+               "arn:aws:sqs:eu-west-1:123247571664:karpenter-presentium",
            ]
+           sid       = "SqsWrite"

+           principals {
+               identifiers = [
+                   "events.amazonaws.com",
+                   "sqs.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # module.eks.module.karpenter.aws_cloudwatch_event_rule.this["health_event"] will be updated in-place
!~  resource "aws_cloudwatch_event_rule" "this" {
        id                  = "KarpenterHealthEvent-20240725220633967200000013"
        name                = "KarpenterHealthEvent-20240725220633967200000013"
        tags                = {
            "ClusterName" = "presentium"
        }
!~      tags_all            = {
+           "Terraform"   = "true"
#            (1 unchanged element hidden)
        }
#        (10 unchanged attributes hidden)
    }

  # module.eks.module.karpenter.aws_cloudwatch_event_rule.this["instance_rebalance"] will be updated in-place
!~  resource "aws_cloudwatch_event_rule" "this" {
        id                  = "KarpenterInstanceRebalance-20240725220633962900000010"
        name                = "KarpenterInstanceRebalance-20240725220633962900000010"
        tags                = {
            "ClusterName" = "presentium"
        }
!~      tags_all            = {
+           "Terraform"   = "true"
#            (1 unchanged element hidden)
        }
#        (10 unchanged attributes hidden)
    }

  # module.eks.module.karpenter.aws_cloudwatch_event_rule.this["instance_state_change"] will be updated in-place
!~  resource "aws_cloudwatch_event_rule" "this" {
        id                  = "KarpenterInstanceStateChange-20240725220633963400000011"
        name                = "KarpenterInstanceStateChange-20240725220633963400000011"
        tags                = {
            "ClusterName" = "presentium"
        }
!~      tags_all            = {
+           "Terraform"   = "true"
#            (1 unchanged element hidden)
        }
#        (10 unchanged attributes hidden)
    }

  # module.eks.module.karpenter.aws_cloudwatch_event_rule.this["spot_interrupt"] will be updated in-place
!~  resource "aws_cloudwatch_event_rule" "this" {
        id                  = "KarpenterSpotInterrupt-20240725220633967000000012"
        name                = "KarpenterSpotInterrupt-20240725220633967000000012"
        tags                = {
            "ClusterName" = "presentium"
        }
!~      tags_all            = {
+           "Terraform"   = "true"
#            (1 unchanged element hidden)
        }
#        (10 unchanged attributes hidden)
    }

  # module.eks.module.karpenter.aws_eks_access_entry.node[0] must be replaced
-/+ resource "aws_eks_access_entry" "node" {
!~      access_entry_arn  = "arn:aws:eks:eu-west-1:123247571664:access-entry/presentium/role/123247571664/MORP-KARPENTER-PRESENTIUM/e6c875f7-a6e1-19f8-50a8-94a0a0a43f94" -> (known after apply)
!~      created_at        = "2024-07-25T22:07:27Z" -> (known after apply)
!~      id                = "*******************************************************************" -> (known after apply)
!~      kubernetes_groups = [
-           "system:nodes",
        ] -> (known after apply)
!~      modified_at       = "2024-07-25T22:07:27Z" -> (known after apply)
!~      principal_arn     = "arn:aws:iam::123247571664:role/MORP-KARPENTER-PRESENTIUM" # forces replacement -> (known after apply) # forces replacement
-       tags              = {} -> null
!~      tags_all          = {
+           "Terraform" = "true"
        }
!~      user_name         = "system:node:{{EC2PrivateDNSName}}" -> (known after apply)
#        (2 unchanged attributes hidden)
    }

  # module.eks.module.karpenter.aws_iam_instance_profile.this[0] must be replaced
-/+ resource "aws_iam_instance_profile" "this" {
!~      arn         = "arn:aws:iam::123247571664:instance-profile/MORP-KARPENTER-PRESENTIUM" -> (known after apply)
!~      create_date = "2024-07-25T22:06:34Z" -> (known after apply)
!~      id          = "*************************" -> (known after apply)
!~      name        = "MORP-KARPENTER-PRESENTIUM" -> "PRES-KARPENTER-PRESENTIUM" # forces replacement
+       name_prefix = (known after apply)
!~      role        = "MORP-KARPENTER-PRESENTIUM" -> "PRES-KARPENTER-PRESENTIUM"
-       tags        = {} -> null
!~      tags_all    = {
+           "Terraform" = "true"
        }
!~      unique_id   = "*********************" -> (known after apply)
#        (1 unchanged attribute hidden)
    }

  # module.eks.module.karpenter.aws_iam_policy.controller[0] must be replaced
-/+ resource "aws_iam_policy" "controller" {
!~      arn              = "arn:aws:iam::123247571664:policy/MORP-KARPENTER-IRSA-PRESENTIUM-20240725220700595400000017" -> (known after apply)
!~      attachment_count = 1 -> (known after apply)
!~      id               = "******************************************************************************************" -> (known after apply)
!~      name             = "MORP-KARPENTER-IRSA-PRESENTIUM-20240725220700595400000017" -> (known after apply)
!~      name_prefix      = "MORP-KARPENTER-IRSA-PRESENTIUM-" -> "PRES-KARPENTER-IRSA-PRESENTIUM-" # forces replacement
!~      policy           = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "ec2:RunInstances",
-                           "ec2:CreateFleet",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:ec2:*::snapshot/*",
-                           "arn:aws:ec2:*::image/*",
-                           "arn:aws:ec2:*:*:subnet/*",
-                           "arn:aws:ec2:*:*:spot-instances-request/*",
-                           "arn:aws:ec2:*:*:security-group/*",
-                           "arn:aws:ec2:*:*:launch-template/*",
                        ]
-                       Sid      = "AllowScopedEC2InstanceActions"
                    },
-                   {
-                       Action    = [
-                           "ec2:RunInstances",
-                           "ec2:CreateLaunchTemplate",
-                           "ec2:CreateFleet",
                        ]
-                       Condition = {
-                           StringEquals = {
-                               "aws:RequestTag/kubernetes.io/cluster/presentium" = "owned"
                            }
-                           StringLike   = {
-                               "aws:RequestTag/karpenter.sh/nodepool" = "*"
                            }
                        }
-                       Effect    = "Allow"
-                       Resource  = [
-                           "arn:aws:ec2:*:*:volume/*",
-                           "arn:aws:ec2:*:*:spot-instances-request/*",
-                           "arn:aws:ec2:*:*:network-interface/*",
-                           "arn:aws:ec2:*:*:launch-template/*",
-                           "arn:aws:ec2:*:*:instance/*",
-                           "arn:aws:ec2:*:*:fleet/*",
                        ]
-                       Sid       = "AllowScopedEC2InstanceActionsWithTags"
                    },
-                   {
-                       Action    = "ec2:CreateTags"
-                       Condition = {
-                           StringEquals = {
-                               "aws:RequestTag/kubernetes.io/cluster/presentium" = "owned"
-                               "ec2:CreateAction"                                = [
-                                   "RunInstances",
-                                   "CreateFleet",
-                                   "CreateLaunchTemplate",
                                ]
                            }
-                           StringLike   = {
-                               "aws:RequestTag/karpenter.sh/nodepool" = "*"
                            }
                        }
-                       Effect    = "Allow"
-                       Resource  = [
-                           "arn:aws:ec2:*:*:volume/*",
-                           "arn:aws:ec2:*:*:spot-instances-request/*",
-                           "arn:aws:ec2:*:*:network-interface/*",
-                           "arn:aws:ec2:*:*:launch-template/*",
-                           "arn:aws:ec2:*:*:instance/*",
-                           "arn:aws:ec2:*:*:fleet/*",
                        ]
-                       Sid       = "AllowScopedResourceCreationTagging"
                    },
-                   {
-                       Action    = "ec2:CreateTags"
-                       Condition = {
-                           "ForAllValues:StringEquals" = {
-                               "aws:TagKeys" = [
-                                   "karpenter.sh/nodeclaim",
-                                   "Name",
                                ]
                            }
-                           StringEquals                = {
-                               "aws:ResourceTag/kubernetes.io/cluster/presentium" = "owned"
                            }
-                           StringLike                  = {
-                               "aws:ResourceTag/karpenter.sh/nodepool" = "*"
                            }
                        }
-                       Effect    = "Allow"
-                       Resource  = "arn:aws:ec2:*:*:instance/*"
-                       Sid       = "AllowScopedResourceTagging"
                    },
-                   {
-                       Action    = [
-                           "ec2:TerminateInstances",
-                           "ec2:DeleteLaunchTemplate",
                        ]
-                       Condition = {
-                           StringEquals = {
-                               "aws:ResourceTag/kubernetes.io/cluster/presentium" = "owned"
                            }
-                           StringLike   = {
-                               "aws:ResourceTag/karpenter.sh/nodepool" = "*"
                            }
                        }
-                       Effect    = "Allow"
-                       Resource  = [
-                           "arn:aws:ec2:*:*:launch-template/*",
-                           "arn:aws:ec2:*:*:instance/*",
                        ]
-                       Sid       = "AllowScopedDeletion"
                    },
-                   {
-                       Action    = [
Plan is too large to fit in a PR comment. See the full plan in the workflow log.
```
</details>

:memo: Plan generated in [Create terraform plan #23](https://github.com/presentium/infrastructure/actions/runs/10286036093)